## Taps
tap 'alienator88/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

## Binaries
brew 'azure-cli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'cmatrix'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'htop'
brew 'lynx'
brew 'mackup'
brew 'mas'
brew 'neofetch'
brew 'powerlevel10k'
brew 'thefuck'
brew 'tldr'
brew 'topgrade'
brew 'tree'
brew 'youtube-dl'
brew 'zsh-syntax-highlighting'

## Apps
# cask 'android-file-transfer'
# cask 'balenaetcher'
# cask 'imazing-profile-editor'
# cask 'parallels'
# cask 'whisky'
cask 'amethyst'
cask 'anydesk'
cask 'arc'
cask 'beeper'
cask 'betterdisplay'
cask 'clipy'
cask 'ditto'
cask 'dozer'
cask 'dropbox'
cask 'firefox'
cask 'font-meslo-for-powerlevel10k'
cask 'gimp'
cask 'github'
cask 'iina'
cask 'imazing'
cask 'iterm2'
cask 'macvim'
cask 'ollama'
cask 'oversight'
cask 'pearcleaner'
cask 'raycast'
cask 'remote-desktop-manager-free'
cask 'sony-ps-remote-play'
cask 'spaceid'
cask 'stats'
cask 'sublime-text'
cask 'switchhosts'
cask 'tailscale'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'vivaldi'
cask 'warp'

## Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

## Mac App Store
mas 'AdGuard for Safari', id: 1440147259
mas 'Amphetamine', id: 937984704
mas 'Bitwarden', id: 1352778147
mas 'Dark Night', id: 1592844577
mas 'Enchanted', id: 6474268307
mas 'Fantastical', id: 975937182
mas 'Hush', id: 1544743900
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Speedtest', id: 1153157709
mas 'Vinegar', id: 1591303229